sprocter/model-rocketry/nene/lil-buddy/micropython-tweaks/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "Nene-customized ESP32S3"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

// Disable UART REPL -- we use UART pins for GPS on the Xiao Nene and this causes conflicts with the UART REPL
#define MICROPY_HW_ENABLE_UART_REPL         (0)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

// Enable ZLib compression
#ifndef MICROPY_PY_DEFLATE_COMPRESS
#define MICROPY_PY_DEFLATE_COMPRESS      (1)
#endif
